src/cf/InformationRegisters/ктв_ИспользованиеИменЛогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ктв_ИспользованиеИменЛогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СпособЛогирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ктв_СпособыЛогирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЛога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ктв_ЛогированиеВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование". (Основной модуль)
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедуры

// Процедура выполняет запись в лог
//
Функция ПолучитьСпособыЛогирования(ИмяЛога) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ИспользованиеИменЛогов.СпособЛогирования КАК СпособЛогирования
	                      |ИЗ
	                      |	РегистрСведений.ктв_ИспользованиеИменЛогов КАК ИспользованиеИменЛогов
	                      |ГДЕ
	                      |	ИспользованиеИменЛогов.ИмяЛога = &ИмяЛога
	                      |	ИЛИ ИспользованиеИменЛогов.СпособЛогирования.ИспользоватьДляВсех");
	
	Запрос.УстановитьПараметр("ИмяЛога", ИмяЛога);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("СпособЛогирования");
	
КонецФункции //ПолучитьСпособыЛогирования()

#КонецОбласти 

#Область ОбработкаЛогирования

// Процедура выполняет запись в лог, с использованием указанного способа логирования
//
// Параметры:
//	СпособЛогирования		- СправочникСсылка.			- используемый способ вывода лога
//							  ктв_СпособыЛогирования
//	Текст					- Строка					- текст выводимого сообщения
//	ПараметрыЗаписи			- Структура					- дополнительные параметры записи информации в лог
//
Процедура ЗаписатьВЛог(СпособЛогирования, Текст, ПараметрыЗаписи) Экспорт
	
	ВремОбработка =
		ктв_ОбработкиОбслуживанияВызовСервера.ПолучитьАдресОбработкиОбслуживанияЭлемента(СпособЛогирования,
																						 "Обработка");
	Если НЕ ктв_ОбработкиОбслуживанияВызовСервера.ЭтоОбработкаОбслуживания(ВремОбработка, "ВыводитьНаСервере") Тогда
		Возврат;
	КонецЕсли;
	
	ВремОбработка = ктв_ОбработкиОбслуживанияВызовСервера.ПолучитьАдресОбработкиОбслуживанияЭлемента(СпособЛогирования, "Обработка");
	
	Обработчик = ктв_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
		
	ТекстОшибки = "";
	
	Попытка
		
		Обработчик.ЗаписатьВЛог(Текст, ПараметрыЗаписи);
		
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ТекстОшибки = ПараметрыЗаписи.ТекстОшибки;
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ПараметрыЗаписи.ТекстОшибки = ПараметрыЗаписи.ТекстОшибки + Символы.ПС + ТекстОшибки;
		Иначе
			ПараметрыЗаписи.Вставить("ТекстОшибки", ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры //ЗаписатьВЛог()

#КонецОбласти
